In [20]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database

# Part 1: Design an ERD

ERD png from project file:

![png](books.png)

# Part 2: Create the database in Python

In [21]:
# Creating a connection to books database
connection = "mysql+pymysql://root:root@localhost/books"

# Creating an engine to connect to the database
engine = create_engine(connection)

# Creating datbase to store the data and checking if it exists
if database_exists(connection) == False:
    create_database(connection)
    print("Database created.")
else:
    print("Database already exists.")

Database already exists.

- Now I will be importing all csv files with Pandas

In [22]:
authors = pd.read_csv('CSV files/authors.csv')
books = pd.read_csv('CSV files/books.csv')
favorites = pd.read_csv('CSV files/favorites.csv')
users = pd.read_csv('CSV files/users.csv')

In [23]:
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [24]:
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [25]:
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [26]:
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [27]:
# Loading the data into the database
authors.to_sql(name='authors', con=engine, if_exists='replace')
books.to_sql(name='books', con=engine, if_exists='replace')
favorites.to_sql(name='favorites', con=engine, if_exists='replace')
users.to_sql(name='users', con=engine, if_exists='replace')

3

## Testing the Database

In [30]:
q = """
SHOW TABLES;
"""

pd.read_sql_query(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [31]:
q = """
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""

pd.read_sql_query(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1